{
  "_name_or_path": "google/electra-large-discriminator",
  "architectures": [
    "USPPPMModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "best_eval_proba_pearson": 0.8429221972464597,
  "classifier_dropout": null,
  "embedding_size": 1024,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "LABEL_0": 0
  },
  "layer_norm_eps": 1e-12,
  "loss": "bce",
  "max_position_embeddings": 512,
  "model_type": "electra",
  "multisample_dropout": null,
  "num_attention_heads": 16,
  "num_concat": 1,
  "num_hidden_layers": 24,
  "output_dropout_prob": 0.2,
  "output_hidden_dim": 512,
  "output_hidden_states": true,
  "output_layer_norm": true,
  "pad_token_id": 0,
  "pooling": "mean",
  "position_embedding_type": "absolute",
  "prompt": "token_type",
  "run_start": "2022-06-13 15:49:17.971014",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.20.0.dev0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522,
  "wandb_id": "1z8eb330",
  "wandb_name": "scarlet-firebrand-213"
}
